In [16]:
# Psssss READ ME! üëãüëì
# The objective of the following code it to clean and transform ABC Coorporation data to make it available for a subsequent analysis. 
# The transformation methods of the data_transformer were developed based on the conclusions from the preliminary Exploratory Data Analysis of the raw data provided by the HR department of BC Coorporation.
# The highlevel code structure is as follows: 
    # 1) Import of packages and data
    # 2) Definition of the DataTransformer class, this is the core of the transformation
    # 3) Execution of the transformation with follows this structure:
        # 3.1) Creation of an object from DataTransformer class
        # 3.2) Rename all columns
        # 3.3) Drop unnecessary columns
        # 3.4) Transform data per column
# Testing code: 
    # For each step of the process the program prints the result so that it can be reviewed and confirm that is working correctly

In [2]:
# Imports üì•

# Packages
#-----------------------------------------------------------------------
import pandas as pd
import numpy as np
from data_transformer import DataTransformer

# Settings
# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None) # to see all columns in DataFrames


# Data 
# -----------------------------------------------------------------------
df = pd.read_csv("Exploratory_Data_Analysis/HR RAW DATA.csv", index_col=0)

In [18]:
# print for testing

df.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",3,0,58,3,5,ManaGER,4,Married,"19232,0",4933,1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0

In [19]:
# # DataTransformer class definition ‚úçÔ∏è

# class DataTransformer:
#     def __init__(self, dataframe):
#         self.df = dataframe

#     def rename_columns (self): 
#         """Transform columns' names to snake format. E.g. 'EducationField' to 'education_field' """
#         columns_names = {
#             'Age': 'age',
#             'Attrition': 'attrition',
#             'BusinessTravel': 'business_travel',
#             'DailyRate': 'daily_rate',
#             'Department': 'department',
#             'DistanceFromHome': 'distance_from_home',
#             'Education': 'education',
#             'EducationField': 'education_field',
#             'employeecount': 'employee_count',
#             'employeenumber': 'employee_number',
#             'EnvironmentSatisfaction': 'environment_satisfaction',
#             'Gender': 'gender',
#             'HourlyRate': 'hourly_rate',
#             'JobInvolvement': 'job_involvement',
#             'JobLevel': 'job_level',
#             'JobRole': 'job_role',
#             'JobSatisfaction': 'job_satisfaction',
#             'MaritalStatus': 'marital_status',
#             'MonthlyIncome': 'monthly_income',
#             'MonthlyRate': 'monthly_rate',
#             'NUMCOMPANIESWORKED': 'num_companies_worked',
#             'Over18': 'over_18',
#             'OverTime': 'over_time',
#             'PercentSalaryHike': 'percent_salary_hike',
#             'PerformanceRating': 'performance_rating',
#             'RelationshipSatisfaction': 'relationship_satisfaction',
#             'StandardHours': 'standard_hours',
#             'StockOptionLevel': 'stock_option_level',
#             'TOTALWORKINGYEARS': 'total_working_years',
#             'TrainingTimesLastYear': 'training_times_last_year',
#             'WORKLIFEBALANCE': 'work_life_balance',
#             'YearsAtCompany': 'years_at_company',
#             'YearsInCurrentRole': 'years_in_current_role',
#             'YearsSinceLastPromotion': 'years_since_last_promotion',
#             'YEARSWITHCURRMANAGER': 'years_with_curr_manager',
#             'SameAsMonthlyIncome': 'same_as_monthly_income',
#             'DateBirth': 'date_birth',
#             'Salary': 'salary',
#             'RoleDepartament': 'role_departament',
#             'NUMBERCHILDREN': 'number_children',
#             'RemoteWork': 'remote_work'
#         }
#         self.df = self.df.rename(columns=columns_names)

#     def replace_gender_values(self):
#         """Replaces the values in the Gender column with 'Male' and 'Female'."""
#         self.df['gender'] = self.df['gender'].replace({0: 'Male', 1: 'Female'})
    
#     def convert_age_to_numbers(self):
#         """Converts numbers written in letters (e.g: 'thirty-two') into numbers written in numbers ('32'). It does NOT change the data type!"""
#         # create a dictionary with numbers written in letters as keys and numbers in numbers as values
#         conversion_dictionary = {
#         "one": 1,
#         "two": 2,
#         "three": 3,
#         "four": 4,
#         "five": 5,
#         "six": 6,
#         "seven": 7,
#         "eight": 8,
#         "nine": 9,
#         "ten": 10,
#         "eleven": 11,
#         "twelve": 12,
#         "thirteen": 13,
#         "fourteen": 14,
#         "fifteen": 15,
#         "sixteen": 16,
#         "seventeen": 17,
#         "eighteen": 18,
#         "nineteen": 19,
#         "twenty": 20,
#         "twenty-one": 21,
#         "twenty-two": 22,
#         "twenty-three": 23,
#         "twenty-four": 24,
#         "twenty-five": 25,
#         "twenty-six": 26,
#         "twenty-seven": 27,
#         "twenty-eight": 28,
#         "twenty-nine": 29,
#         "thirty": 30,
#         "thirty-one": 31,
#         "thirty-two": 32,
#         "thirty-three": 33,
#         "thirty-four": 34,
#         "thirty-five": 35,
#         "thirty-six": 36,
#         "thirty-seven": 37,
#         "thirty-eight": 38,
#         "thirty-nine": 39,
#         "forty": 40,
#         "forty-one": 41,
#         "forty-two": 42,
#         "forty-three": 43,
#         "forty-four": 44,
#         "forty-five": 45,
#         "forty-six": 46,
#         "forty-seven": 47,
#         "forty-eight": 48,
#         "forty-nine": 49,
#         "fifty": 50,
#         "fifty-one": 51,
#         "fifty-two": 52,
#         "fifty-three": 53,
#         "fifty-four": 54,
#         "fifty-five": 55,
#         "fifty-six": 56,
#         "fifty-seven": 57,
#         "fifty-eight": 58,
#         "fifty-nine": 59,
#         "sixty": 60,
#         "sixty-one": 61,
#         "sixty-two": 62,
#         "sixty-three": 63,
#         "sixty-four": 64,
#         "sixty-five": 65,
#         "sixty-six": 66,
#         "sixty-seven": 67,
#         "sixty-eight": 68,
#         "sixty-nine": 69,
#         "seventy": 70,
#         "seventy-one": 71,
#         "seventy-two": 72,
#         "seventy-three": 73,
#         "seventy-four": 74,
#         "seventy-five": 75,
#         "seventy-six": 76,
#         "seventy-seven": 77,
#         "seventy-eight": 78,
#         "seventy-nine": 79,
#         "eighty": 80,
#         "eighty-one": 81,
#         "eighty-two": 82,
#         "eighty-three": 83,
#         "eighty-four": 84,
#         "eighty-five": 85,
#         "eighty-six": 86,
#         "eighty-seven": 87,
#         "eighty-eight": 88,
#         "eighty-nine": 89,
#         "ninety": 90,
#         "ninety-one": 91,
#         "ninety-two": 92,
#         "ninety-three": 93,
#         "ninety-four": 94,
#         "ninety-five": 95,
#         "ninety-six": 96,
#         "ninety-seven": 97,
#         "ninety-eight": 98,
#         "ninety-nine": 99,
#         "one hundred": 100
#         }
#         for index, value in enumerate(self.df["age"].values): 
#             if value in conversion_dictionary:
#                 self.df["age"][index] = conversion_dictionary[value]
#                 print (f"Value '{value}' was transformed into '{conversion_dictionary[value]}'")
                
#     def convert_to_numeric(self, column_name, downcast):
#         """Converts a column to numeric type. Downcast = 'integer' or 'float'"""
#         self.df[column_name] = pd.to_numeric(self.df[column_name], errors='raise', downcast=downcast)

#     def fix_negative_distances(self):
#         """Corrects negative values in the DistanceFromHome column."""
#         self.df['distance_from_home'] = self.df['distance_from_home'].abs()

#     def drop_redundant_columns(self, columns):
#             """Drops redundant columns like 'same_as_monthly_income'. Param columns is a list of columns to de dropped"""
#             self.df.drop(columns=columns, inplace=True, errors='ignore')

#     def correct_env_satisfaction_values(self):
#         """Transform values higher than 4 into NaN"""
#         self.df['environment_satisfaction'] = self.df['environment_satisfaction'].apply(lambda x: x if x <= 4 else np.nan)

#     def correct_hourly_rate(self):
#         """Transform all values from the column into into numeric and 'Not Available' into NaN"""
        
#         def transform_hourly_rate_individual (value):
#             """Transform a value into numeric and 'Not Available' into NaN"""
#             if value == "Not Available":
#                 value = np.nan
#             return float(value)

#         self.df['hourly_rate'] = self.df['hourly_rate'].apply(transform_hourly_rate_individual)

#     def transform_to_float(self,column_name):
#         """Transform strings with format '3579,0' in float"""

#         self.df[column_name] = self.df[column_name].str.replace(',','.').astype(float)

#     def quick_check(self,column_name):
#         """ This function is for testiing purposes, to quicky check data type and unique values of a column"""
#         print (f"Column name: {column_name}")
#         print (f"Data type: {self.df[column_name].dtype}")
#         print (f"Value count: {self.df[column_name].notnull().count()}")
#         print (f"Not null count: {self.df[column_name].notnull().sum()}")
#         print (f"Null count: {self.df[column_name].isnull().sum()}")
#         print (f"Duplicated values count: {self.df[column_name].duplicated(keep=False).sum()}")
#         print (f"Unique values: {self.df[column_name].unique()}")

#     def correct_typographical_errors(self):
#         """Corrects typographical errors in the marital_status column."""
#         self.df['marital_status'] = self.df['marital_status'].replace({'Marreid': 'Married','divorced':'Divorced'})

#     def get_dataframe(self):
#         """Returns the transformed DataFrame."""
#         return self.df

#     def remove_duplicates(self):
#         """Removes rows with duplicated employee_number, keeping the last appearance. Rows with NaN values are kept"""
#         # Separate rows with NaN from those without NaN
#         df_na = self.df[self.df["employee_number"].isna()]
#         df_no_na = self.df[self.df["employee_number"].notna()]
#         # Delete duplicates from rows without NaN
#         df_no_na_unique = df_no_na.drop_duplicates(subset=['employee_number'], keep='last')
#         # Rebuild original DataFrame
#         self.df = pd.concat([df_no_na_unique, df_na]).sort_index()

In [20]:
# ‚ñ∂Ô∏è Instantiating a class object üê£

abc_data = DataTransformer(df)

# print for testing
abc_data.df.head(2)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1

In [21]:
# ‚ñ∂Ô∏è Rename columns

abc_data.rename_columns()

# print for checking

abc_data.df.head(1)

,age,attrition,business_travel,daily_rate,department,distance_from_home,education,education_field,employee_count,employee_number,environment_satisfaction,gender,hourly_rate,job_involvement,job_level,job_role,job_satisfaction,marital_status,monthly_income,monthly_rate,num_companies_worked,over_18,over_time,percent_salary_hike,performance_rating,relationship_satisfaction,standard_hours,stock_option_level,total_working_years,training_times_last_year,work_life_balance,years_at_company,years_in_current_role,years_since_last_promotion,years_with_curr_manager,same_as_monthly_income,date_birth,salary,role_departament,number_children,remote_work
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes

In [22]:
# ‚ñ∂Ô∏è Transform "age" column data

column_name = "age"
# convert number written in letters into into numbers written in numbers

abc_data.convert_age_to_numbers()

# convert column to "int"

abc_data.convert_to_numeric (column_name,"integer")

# print for testing

abc_data.quick_check(column_name)

/mnt/c/Users/carla/Desktop/Adalab/module_3/project/People-Analytics/data_transformer.py:203: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.df["age"][index] = conversion_dictionary[value]

Value 'forty-seven' was transformed into '47'
Value 'fifty-eight' was transformed into '58'
Value 'thirty-six' was transformed into '36'
Value 'fifty-five' was transformed into '55'
Value 'fifty-two' was transformed into '52'
Value 'thirty-one' was transformed into '31'
Value 'thirty' was transformed into '30'
Value 'twenty-six' was transformed into '26'
Value 'thirty-seven' was transformed into '37'
Value 'thirty-two' was transformed into '32'
Value 'twenty-four' was transformed into '24'
Value 'thirty-two' was transformed into '32'
Column name: age
Data type: int8
Unique values: [51 52 42 47 46 48 59 41 56 38 55 40 58 35 45 33 36 34 53 43 60 32 37 49
 39 50 44 30 29 31 54 57 27 28 26 25 24 23 22 21 20 19 18]
Not null count: 1614
Null count: 0
Duplicated values: 1571

In [23]:
# ‚ñ∂Ô∏è Transform "distance_from_home" column data

# Corrects negative values in the distance_from_home column

abc_data.fix_negative_distances()

# print for testing
print("Printing 'distance_from_home' colum unique values for testing:")
print(abc_data.df["distance_from_home"].unique())

Printing 'distance_from_home' colum unique values for testing:
[ 6  1  4  2  3 22 25  9  7 23 10 12 14 13 15  8 42 28 37  5 16 35 26 24
 29 17 21 18 30 27 20 31 39 11 19 33 34 46 36 45 47 32 41 49 48 38 43 40
 44]

In [24]:
# ‚ñ∂Ô∏è Transform "environment_satisfaction" column data

abc_data.correct_env_satisfaction_values()

# print for testing

abc_data.quick_check("environment_satisfaction")

acceptance_criteria = "Data type is float and there isn't any value different than 1,2,3 or 4"
print (f"\nAcceptance criteria: {acceptance_criteria}")

Column name: environment_satisfaction
Data type: float64
Unique values: [ 1.  3.  4.  2. nan]
Not null count: 1514
Null count: 100
Duplicated values: 1609

Acceptance criteria: Data type is float and there isn't any value different than 1,2,3 or 4

In [25]:
# ‚ñ∂Ô∏è Transform "gender" column data

# Replace the values in the Gender column with 'Male' and 'Female'

abc_data.replace_gender_values()

# print for checking

abc_data.quick_check("gender")

acceptance_criteria = "Unique values are male or female"
print (f"\nAcceptance criteria: {acceptance_criteria}")

Column name: gender
Data type: object
Unique values: ['Male' 'Female']
Not null count: 1614
Null count: 0
Duplicated values: 1612

Acceptance criteria: Unique values are male or female

In [26]:
# ‚ñ∂Ô∏è Transform "hourly_rate" column data

abc_data.correct_hourly_rate()


# print for testing
abc_data.quick_check("hourly_rate")

acceptance_criteria = ""
print (f"\nAcceptance criteria: {acceptance_criteria}")

Column name: hourly_rate
Data type: float64
Unique values: [ 51.  65.  58.  82.  45.  99.  91.  64.  55.  68.  49.  61.  79.  31.
  69.  48.  80.  74.  98.  59.  33.  56.  66.  57.  53.  87.  81.  84.
  32.  41.  92.  47.  nan  43.  86.  30.  42.  88.  96.  67.  62.  72.
  78.  89.  52.  50.  90.  37.  94.  76.  60.  46.  83. 100.  40.  97.
  54.  75.  39.  85.  63.  44.  93.  36.  35.  73.  71.  70.  38.  77.
  95.  34.]
Not null count: 1530
Null count: 84
Duplicated values: 1542

Acceptance criteria:

In [27]:
# ‚ñ∂Ô∏è Transform "monthly_income" column data

abc_data.transform_to_float("monthly_income")

# print for testing

abc_data.quick_check("monthly_income")

acceptance_criteria = "\n- Datatye is numeric."
print (f"\nAcceptance criteria: {acceptance_criteria}")

Column name: monthly_income
Data type: float64
Unique values: [19537. 19999. 19232. 17169.    nan 17174. 16595. 19973. 13402. 13206.
 19545. 18041. 19246. 10748. 16752.  6201. 19845.  4001. 10447. 16064.
  3210. 10266. 10475.  6162.  4721.  4615. 16959. 10306.  5406.  5902.
 10855.  5914.  6646. 13973. 13320.  6687.  4735. 13872. 19045. 16015.
  9613. 11510.  4306. 17046.  5067.  3692. 19847.  2308.  5747. 10422.
  6347.  2348.  3072. 12490.  8020. 17068.  8943. 19272.  5577.  2691.
  7403.  8823.  3579. 17779. 18213. 13577. 19190. 17123. 19187. 10008.
  7988.  7083.  4723.  3407.  2929. 12031. 15427.  5126.  9619.  5010.
 19033. 10400.  2793.  5674. 19197.  8412.  3348.  5309.  7654. 12808.
  6586.  2519. 17099. 13120.  3131.  4444.  6674.  9852. 17861.  7446.
 13757. 16598.  4285. 10124.  9714.  9924. 11245.  3069.  9241.  6472.
  3055.  8321.  3143.  8578.  4197.  9888. 13341.  5677.  2909.  9526.
  6825.  4424.  5441.  6074.  6146.  6172.  4668.  5605.  4319.  3564.
  6261.  6804. 19436.  5828.  2455.  5055.  4682.  5257.  2119.  5974.
  3034. 13212.  8392.  4051.  4805.  2741.  5337.  9434.  5396. 11159.
  4960.  8793. 19189.  2216. 11713.  5304. 11103.  6632.  7587.  4335.
  5980.  4244.  5228.  2700.  2366.  2329.  4294.  6725. 10325.  4447.
 10845.  5472.  6385.  7525.  3660.  8740. 13499.  3491.  5220. 10252.
 19740.  6209.  7094.  4534.  8500.  4639.  5363.  4081.  3578. 17328.
 10793. 10851. 10466.  2362.  6439.  5769.  4385.  4066.  5206.  2655.
  2570.  4502.  4968.  5147.  2718.  3539.  5468.  5813.  9667.  5154.
  5675.  7314.  5098. 13570.  6712.  9991. 10248. 10938.  2593. 11878.
  8095. 16856.  4537. 17924.  4014. 12742.  3376. 10482.  4249.  6549.
 14411. 19586.  8237.  3211. 16704.  4774.  4568.  5993.  6499.  3452.
  6397.  2725.  3622.  6180.  6274.  4381.  2559.  5488.  2514.  3196.
  3420.  4087.  5368. 12936.  4221.  4963.  4200.  5006.  7639.  6502.
 13525.  6349.  6380.  3102.  4556.  4230.  4859.  6322. 10761.  2973.
  5204. 17399. 16885.  4323.  5155.  2936. 18789.  4883.  2029.  2996.
  9278.  4162.  8853.  4876.  2141.  7756.  3936.  6842.  3989.  4930.
  3702.  2705.  4448.  2379.  5487.  2810.  8938.  9936.  5454. 18740.
  5473. 13503. 13549. 18172.  2774.  9439.  5265.  3815.  2389.  4000.
 17584.  5661.  4869.  4649. 10496.  2768.  3408.  3755.  2187.  4258.
  5326.  5485.  2782. 17639.  6062.  6288.  3424.  4194.  2532.  5666.
 13726.  4107.  3597.  4115.  6272.  2517.  3904.  9204.  4373.  2064.
  2430.  4877.  3760.  2013.  2974.  2766.  3377.  4213.  6513.  4284.
  2226.  5561.  2144.  5373.  2897.  5321.  5410.  4850.  2001.  4404.
  3944.  2960. 18947.  6465.  2683.  2014.  3441. 13664.  5021. 18844.
  4739. 10650.  4317.  2024.  3058.  3929.  4425.  2328.  2657.  5940.
  2622.  3212.  2911.  6931.  2176.  3230. 18665.  2789.  6410.  4941.
  3983.  2904.  2696.  2174.  6755. 10965.  2543. 19406.  6538.  2258.
  2218.  2654. 11935.  2546.  3894.  4262. 10527.  2400.  3681.  3447.
 19513.  2659.  8847.  2045.  4851.  8120.  4577.  5405.  3708. 13770.
  2297.  2450.  4342.  2572.  6500.  3149.  5324.  4382.  2553.  5933.
  4403. 10934.  2022.  4256.  3580.  2899.  5562.  2377.  2404.  2799.
  2811.  4377.  4240.  4227.  3917.  4969.  2042.  2821.  9957.  2207.
  2070.  2791.  8224.  2610.  5731.  2539.  2376. 19081.  2743.  4538.
  3867.  2080.  2096.  4627.  2302.  5071. 10596.  5467.  2394.  3629.
  9362.  3229. 16422.  5647.  4400.  2066.  5486.  3162.  6651.  4898.
  3180. 11244.  4069.  6392.  4855.  3312.  3117. 15202.  2580.  2166.
  4374.  5505.  2587. 15972.  2305.  3433.  3477.  3907.  3445.  2760.
  6294. 13116.  3591.  2105.  3902.  2662.  2062.  5507.  8103.  3978.
  5399. 10448.  4440.  2660.  3375.  2269.  4787.  2809. 10854.  2571.
  6142.  2496.  3419.  2501.  2566.  3920. 13964.  6540.  2244. 16184.
  4233. 14814. 17159.  2318.  3617.  2684. 19237.  4422.  2552.  2678.
  5171. 11916.  9380.  5878.  2468.  4127.  2148.  3886.  6667.  2090.
  2086.  1951.  3022.  9724.  3388.  3038.  2322.  2926.  4505.  2835.
  6553.  6673. 13591.  2177. 19517. 19202. 10048.  2723.  6644.  3161.
  1420.  1200.  5238.  9985. 15992.  2370.  6781.  6653.  2851.  5258.
  2476.  2285.  3448.  4558.  1702.  2564.  5070.  3780.  9824.  1878.
  2340.  2127.  2033.  9602. 16627.  2083.  1009.  7861.  2642.  5121.
  2694.  5094.  2274.  2314.  2380.  2008. 10552.  2259.  2413.  2121.
  2479. 13194.  4163.  2600. 18303.  4777.  1052.  2461.  2596.  4728.
  7351.  4766.  2827.  2853.  2290.  2107.  2210. 13191. 18265.  1118.
  2372.  2838. 18061.  1611.  4768.  1274.  2561.  1563.  6388.  8376.
  4841.  2074.  2972.  6815.  2690. 17567.  1569.  4187.  3306.  1393.
 10883.  2862.  6735.  9756.  5294.  2437.  4071.  2956.  4648.  2804.
  2439.  2856.  2933.  1091.  5151.  2863.  2858.  1129. 19431.]
Not null count: 771
Null count: 843
Duplicated values: 945

Acceptance criteria:
- Datatye is numeric.

In [28]:
# ‚ñ∂Ô∏è Transform "performance_rating" column data

abc_data.transform_to_float("performance_rating")


# print for testing

abc_data.quick_check("performance_rating")

acceptance_criteria = "\n- Datatye is numeric."
print (f"\nAcceptance criteria: {acceptance_criteria}")

Column name: performance_rating
Data type: float64
Unique values: [ 3.  4. nan]
Not null count: 1419
Null count: 195
Duplicated values: 1611

Acceptance criteria:
- Datatye is numeric.

In [29]:
# ‚ñ∂Ô∏è Transform "total_working_years" column data

abc_data.transform_to_float("total_working_years")

abc_data.quick_check("total_working_years")

acceptance_criteria = "\n- Datatye is numeric."
print (f"\nAcceptance criteria: {acceptance_criteria}")

Column name: total_working_years
Data type: float64
Unique values: [nan 34. 22. 28. 20. 21. 33. 40. 18. 25. 15. 17. 26. 16. 24. 14. 23. 27.
 19. 11. 38. 37. 13. 12. 29. 10. 36. 35.  9. 31. 32.  8.  7. 30.  6.  5.
  4.  3.  2.  1.  0.]
Not null count: 1088
Null count: 526
Duplicated values: 1573

Acceptance criteria:
- Datatye is numeric.

In [30]:
# ‚ñ∂Ô∏è Transform "work_life_balance" column data

abc_data.transform_to_float("work_life_balance")

# print for testing
abc_data.quick_check("work_life_balance")

acceptance_criteria = "\n- Datatye is numeric."
print (f"\nAcceptance criteria: {acceptance_criteria}")

Column name: work_life_balance
Data type: float64
Unique values: [ 3. nan  2.  4.  1.]
Not null count: 1506
Null count: 108
Duplicated values: 1609

Acceptance criteria:
- Datatye is numeric.

In [31]:
# ‚ñ∂Ô∏è Transform "marital_status" data

abc_data.correct_typos_marital_status()

# print for testing

abc_data.quick_check("marital_status")
acceptance_criteria = "\n- Unique values are either NaN, 'Married', 'Divorced' or 'Single' and there is no missspelling"
print (f"\nAcceptance criteria: {acceptance_criteria}")

AttributeError: 'DataTransformer' object has no attribute 'correct_typos_marital_status'

In [ ]:
# ‚ñ∂Ô∏è Transform "employee_number" data: remove duplicates and change format to float

abc_data.remove_duplicates()

abc_data.transform_to_float("employee_number")

# print for testing

abc_data.quick_check("employee_number")
acceptance_criteria = "\n- There are no duplicates other than NaN\n- Datatype is numeric"
print (f"\nAcceptance criteria: {acceptance_criteria}")

In [ ]:
# ‚ñ∂Ô∏è convert_object_to_float_eliminate_dolar

abc_data.convert_object_to_float_eliminate_dolar("daily_rate")


abc_data.quick_check("daily_rate")

In [ ]:
# ‚ñ∂Ô∏è Transform "remote work"
abc_data.map_column_remote_work()

abc_data.quick_check("remote_work")

In [ ]:
# ‚ñ∂Ô∏è Change nulls for unknown category in categorial variable

# if we want to change more than one column , put a list
columns_modify = []
abc_data.change_null_for_unknown(columns_modify)


# print for tasting

for column in columns_modify:
    abc_data.quick_check(column)
    print("--------------------------------")

In [ ]:
# ‚ñ∂Ô∏è Change nulls for mode in categorical variable

# if we want to change more than one column, put a list
columns_modify = []
abc_data.change_null_for_mode(columns_modify)


# print for tasting
for column in columns_modify:
    abc_data.quick_check(column)
    print("--------------------------------")

In [ ]:
# ‚ñ∂Ô∏è Change nulls for mean in numerical variable when we have a 0-10% of nulls in numerical category and distribution is normal

# if we want to change more than one column , put a list
columns_modify = []
abc_data.change_null_for_mean(columns_modify)

# print for tasting
for column in columns_modify:
    abc_data.quick_check(column)
    print("--------------------------------")

In [ ]:
# ‚ñ∂Ô∏è Change nulls for median in numerical variable when we have a 0-10% of nulls in numerical category and distribution is atypical

# if we want to change more than one column , put a list
columns_modify = []
abc_data.change_null_for_median(columns_modify)

# print for tasting
for column in columns_modify:
    abc_data.quick_check(column)
    print("--------------------------------")

In [ ]:
# ‚ñ∂Ô∏è Change nulls for distribution KNN in numerical variable when we have more 10% of nulls in numerical category 

# if we want to change more than one column , put a list
columns_modify = []
abc_data.change_null_for_mean(columns_modify)


# print for tasting
for column in columns_modify:
    abc_data.quick_check(column)
    print("--------------------------------")

In [ ]:
# ‚ñ∂Ô∏è Convert_role_to_department and normalize job_role letters

abc_data.convert_role_to_department_normalize_job_role()

# prints for testing

print("\n")
abc_data.quick_check("job_role")

print("\n")
abc_data.quick_check("department")

abc_data.df[["job_role","department"]].sample(50)

In [32]:
# ‚ñ∂Ô∏è Drop un-needed coulumns

columns_to_delete = ["employee_count", "same_as_monthly_income", "salary", "number_children", "standard_hours", "years_in_current_role", "over_18", "role_departament"]

abc_data.drop_redundant_columns(columns_to_delete)

# print for testing

for i in range(len(columns_to_delete)):
    try:
        print(abc_data.df[i])
    except: 
        print(f"Column '{columns_to_delete[i]}' deleted")

Column 'employee_count' deleted
Column 'same_as_monthly_income' deleted
Column 'salary' deleted
Column 'number_children' deleted
Column 'standard_hours' deleted
Column 'years_in_current_role' deleted
Column 'over_18' deleted
Column 'role_departament' deleted

In [33]:
# ‚ñ∂Ô∏è create .csv

abc_data.create_csv()